In [1]:
import numpy as np
import pandas as pd

In [2]:
lebels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=lebels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,lebels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr,lebels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
#panda series can hold every thing like below it holds the references of functions
pd.Series(data=[sum,type,max])

0    <built-in function sum>
1             <class 'type'>
2    <built-in function max>
dtype: object

In [9]:
ser1 = pd.Series([1,2,3,4],['Pakistan','usa','china','germany'])

In [10]:
ser1

Pakistan    1
usa         2
china       3
germany     4
dtype: int64

In [11]:
ser2 = pd.Series([1,5,3,4],['Pakistan','Turkey','china','germany'])
ser2

Pakistan    1
Turkey      5
china       3
germany     4
dtype: int64

In [12]:
ser2['china']

3

In [13]:
ser2[2]

3

In [14]:
ser2.keys()

Index(['Pakistan', 'Turkey', 'china', 'germany'], dtype='object')

In [15]:
#it adds the number by matching indexs, if its not matching it put nan on value
ser1+ser2

Pakistan    2.0
Turkey      NaN
china       6.0
germany     8.0
usa         NaN
dtype: float64

In [16]:
#DataFrames
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
#dataframes made by data,indexs,columes
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [19]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [20]:
type(df['w'])

pandas.core.series.Series

In [21]:
df['w']['a']

2.706849839399938

In [22]:
#butt it is not good because 'df.' have alot built in functions and it could be confuse
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [23]:
df.w.a

2.706849839399938

In [24]:
df[['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [25]:
df[['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [26]:
#to create new colume
df['new'] = df['w']+df['x']

In [27]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [28]:
#to delete, drop(name,axis), axis=0 for row and 1 for colume,and inplace=True to permanently delete(if you not give inplace=True
#it is not effect on original dataframe to save of accidental data lose
df.drop('new',1,inplace=True)

In [29]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
df.drop('d',0,inplace=True)

In [31]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
e  0.190794  1.978757  2.605967  0.683509

In [32]:
#to grabe rows
#loc method for lebels index
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [33]:
#iloc for number index
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [34]:
#for subsets loc(row,colume)
df.loc['a','w']

2.706849839399938

In [35]:
df.iloc[0,0]

2.706849839399938

In [36]:
df.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [37]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
e  0.190794  1.978757  2.605967  0.683509

In [38]:
#dataframe part 2
df > 0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
e   True   True   True   True

In [39]:
booldf= df>0

In [40]:
#shows values where true and nan on false
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
e  0.190794  1.978757  2.605967  0.683509

In [41]:
#bu that it only shows the true rows according to colume 'w'
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
e  0.190794  1.978757  2.605967  0.683509

In [42]:
#by that we can get values according to 'w' and shows only 'x' colume
df[df['w']>0]['x']

a    0.628133
b   -0.319318
e    1.978757
Name: x, dtype: float64

In [44]:
df[df['w']>0][['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
e  1.978757  2.605967

In [52]:
#to proform multiple conditions, we use '&'=multiple boolean check; instead of 'and'=single boolean check
df[(df['w']>0) & (df['y']<0)]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965

In [53]:
#to proform multiple conditions, we use '|'=multiple boolean check; instead of 'or'=single boolean check
df[(df['w']>0) | (df['y']<0)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
e  0.190794  1.978757  2.605967  0.683509

In [54]:
#it makes a new colome and place all the row names in it and shows numbering of it selfs
#place 'inplace=true' to chnage it permanent on original dataframe
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     e  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
e  0.190794  1.978757  2.605967  0.683509

In [56]:
#to make a list by spliting a string
new = "ca ba da ea".split()
new

['ca', 'ba', 'da', 'ea']

In [57]:
df['states'] = new

In [58]:
#to make a colume to index
#place 'inplace=true' to chnage it permanent on original dataframe
df.set_index('states')

               w         x         y         z
states
ca      2.706850  0.628133  0.907969  0.503826
ba      0.651118 -0.319318 -0.848077  0.605965
da     -2.018168  0.740122  0.528813 -0.589001
ea      0.190794  1.978757  2.605967  0.683509

In [59]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     ca
b  0.651118 -0.319318 -0.848077  0.605965     ba
c -2.018168  0.740122  0.528813 -0.589001     da
e  0.190794  1.978757  2.605967  0.683509     ea

In [61]:
#dataframe part 2 fuck
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
#to make list of tuples like:[('G1',1)]
hier_index=list(zip(outside,inside))
#to make multiindex from list of tuples
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [63]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [64]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [66]:
#indexing first grap outside then inside
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [67]:
#to give the names of outside and inside
df.index.names = ['Groups','Numbers']

In [68]:
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [69]:
#indexing first grap outside then inside and then colume name
df.loc['G1'].loc[1]['B']

1.693722925204035

In [71]:
#cross section indexing paramerters(what you want,from where it is)
#by that we get number='1' values both from G1 and G2 which is difficult by df.loc()
df.xs(1,level='Numbers')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [2]:
import numpy as np
import pandas as pd
#starting missing data
d = {'A':[1,2,np.nan],'B':[2,np.nan,np.nan],'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
#to remove nan values by colume(axis=1) or row
#it remove whole row or colume which have nan walue
df.dropna()

     A    B  C
0  1.0  2.0  1

In [7]:
df.dropna(1)

   C
0  1
1  2
2  3

In [8]:
#'thresh' parameter use to make check to keep the data which has more or equal  non-null values then thresh=value given 
df.dropna(thresh=2)

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2

In [9]:
#use to fill the nan values
df.fillna(value='filled')

        A       B  C
0       1       2  1
1       2  filled  2
2  filled  filled  3

In [10]:
#to replace the nan value with the mean of that colume
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
#GroupBy started
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [12]:
df=pd.DataFrame(data)

In [15]:
#make group by colume 'company'
bycompany=df.groupby('Company')

In [16]:
#it perform mean function on all colume butt person not shown because it has string values
bycompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
bycompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [18]:
bycompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [19]:
#to sum and filter the value
bycompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [20]:
# in single step
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [27]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [30]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [31]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [32]:
#Merging, Joining, and Concatenating
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [33]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [34]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [36]:
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [40]:
#it concat the dataframe according to rows
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [41]:
#to concat according to columes
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [42]:
#merging
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [43]:
#(data1,data2,how to merge,key colume)
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [44]:
#multi key points
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [45]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [46]:
#outer make all row by value get or not(if there is no value it place nan there)
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [47]:
#Joining
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [48]:
#join base on the key which is index there
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [49]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [1]:
#Operatons
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
#finding uniuque values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
len(df['col2'].unique())

3

In [4]:
df['col2'].nunique()

3

In [5]:
#to check how many times values repeats
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
#Apply Function
#it is use to apply custom function to dataframe
def time2(x):
    return x*2

In [7]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [8]:
#we can also apply built in functions like col3 has string to find length 
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [9]:
#to show all colume names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [10]:
#to check index names
df.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#sorting
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [12]:
#to check null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [2]:
#Data Input and Output
import pandas as pd
df=pd.read_excel('Excel_Sample.xlsx')

In [3]:
#to save that dataframe into different file(any farmat)
#("file name",index=False for to not save index as a colume)
df.to_csv("ByPanda",index=False)

In [4]:
pd.read_csv('ByPanda')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [5]:
#we can use sheet parameter if we have multiple sheet in our excal file
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
df.to_excel('Excel_Sample1.xlsx',sheet_name='Sheet2')

In [8]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')

In [12]:
data

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

In [13]:
type(data)

list

In [14]:
#panda relate with html tables so it store in a list 
#so what we want is in index 0 of a list
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [15]:
#that is a Dataframe
type(data[0])

pandas.core.frame.DataFrame

In [17]:
from sqlalchemy import create_engine

In [18]:
engine = create_engine("sqlite:///:memory:")

In [19]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [20]:
#(file name , con=connect)
df.to_sql("Mytable",con=engine)

In [23]:
sqldf=pd.read_sql("Mytable",con=engine)

In [24]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

In [1]:
#Exercise
import pandas as pd

In [2]:
df = pd.read_csv("Salaries.csv")

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [9]:
df['BasePay'].mean()

66325.44884050643

In [10]:
df['OvertimePay'].max()

245131.88

In [18]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [19]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [21]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [28]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [58]:
print('2011',df[df['Year']==2011]['BasePay'].mean())
print('2012',df[df['Year']==2012]['BasePay'].mean())
print('2013',df[df['Year']==2013]['BasePay'].mean())
print('2014',df[df['Year']==2014]['BasePay'].mean())

2011 63595.956516774524
2012 65436.40685742255
2013 69630.0302164812
2014 66564.42192449933

In [40]:
a=df['JobTitle'].unique()
import numpy as np
np.count_nonzero(a)

2159

In [48]:
a=df['JobTitle'].value_counts()
for i in range(5):
    print(a[i])

7036
4389
3736
2518
2421

In [50]:
df['JobTitle'].value_counts()

Transit Operator                 7036
Special Nurse                    4389
Registered Nurse                 3736
Public Svc Aide-Public Works     2518
Police Officer 3                 2421
                                 ...
SENIOR CLAIMS INVESTIGATOR          1
PIANIST                             1
Pianist                             1
CEMENT FINISHER SUPERVISOR II       1
COURT PARALEGAL                     1
Name: JobTitle, Length: 2159, dtype: int64

In [1]:
#Ecomerance Pandas Exercise
import pandas as pd

In [2]:
ecom = pd.read_csv("Ecommerce Purchases")

In [3]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [4]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [5]:
ecom['Purchase Price'].mean()

50.34730200000025

In [6]:
ecom['Purchase Price'].max()

99.99

In [7]:
ecom['Purchase Price'].min()

0.0

In [14]:
ecom[ecom['Language']=='el'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1137 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           1137 non-null   object
 1   Lot               1137 non-null   object
 2   AM or PM          1137 non-null   object
 3   Browser Info      1137 non-null   object
 4   Company           1137 non-null   object
 5   Credit Card       1137 non-null   int64
 6   CC Exp Date       1137 non-null   object
 7   CC Security Code  1137 non-null   int64
 8   CC Provider       1137 non-null   object
 9   Email             1137 non-null   object
 10  Job               1137 non-null   object
 11  IP Address        1137 non-null   object
 12  Language          1137 non-null   object
 13  Purchase Price    1137 non-null   float64
dtypes: float64(1), int64(2), object(11)
memory usage: 133.2+ KB

In [15]:
ecom[ecom['Job']=='Lawyer'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           30 non-null     object
 1   Lot               30 non-null     object
 2   AM or PM          30 non-null     object
 3   Browser Info      30 non-null     object
 4   Company           30 non-null     object
 5   Credit Card       30 non-null     int64
 6   CC Exp Date       30 non-null     object
 7   CC Security Code  30 non-null     int64
 8   CC Provider       30 non-null     object
 9   Email             30 non-null     object
 10  Job               30 non-null     object
 11  IP Address        30 non-null     object
 12  Language          30 non-null     object
 13  Purchase Price    30 non-null     float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

In [16]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [18]:
ecom['Job'].value_counts()[:5]

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Designer, jewellery              27
Purchasing manager               27
Name: Job, dtype: int64

In [19]:
ecom[ecom['Lot']=="90 WT"]['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [20]:
ecom[ecom['Credit Card']==4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [31]:
ecom[(ecom['CC Provider']=="American Express") & (ecom['Purchase Price']>95)].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39 entries, 9 to 9856
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           39 non-null     object
 1   Lot               39 non-null     object
 2   AM or PM          39 non-null     object
 3   Browser Info      39 non-null     object
 4   Company           39 non-null     object
 5   Credit Card       39 non-null     int64
 6   CC Exp Date       39 non-null     object
 7   CC Security Code  39 non-null     int64
 8   CC Provider       39 non-null     object
 9   Email             39 non-null     object
 10  Job               39 non-null     object
 11  IP Address        39 non-null     object
 12  Language          39 non-null     object
 13  Purchase Price    39 non-null     float64
dtypes: float64(1), int64(2), object(11)
memory usage: 4.6+ KB

In [70]:
for i in range(1,13):
    print(ecom[ecom['CC Exp Date']==f'{i}/25'])

Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
Empty DataFrame
Columns: [Address, Lot, AM or PM, Browser Info, Company, Credit Card, CC Exp Date, CC Security Code, CC Provider, Email, Job, IP Address, Language, Purchase Price]
Index: []
                                                Address    Lot AM or PM  \
4     23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...  20 IE       AM
168    4380 Kimberly Turnpike\nLewisstad, ID 09757-6270  31 Gh       AM
169      2100 Kristin Groves\nLake Ricky, SD 69827-8308  59 CS       PM
236   9046 Henry Centers Apt. 649\nNorth Anna, MN 08999  14 ve       PM
325   87149 Linda Port Suite 576\nWest Nicole, MS 27...  79 tR       AM
...                                                 ...    ...      ...
8970  48922 Bates Haven Suite 013\nWallacetown, MD 3...  69 Or       PM
8994  941 Smith Viaduct Apt. 859\nSouth Ritaside, NE...  71 uu       AM
9525                   PSC 8080, Box 8270\nAPO AE 26014  31 Ol       PM
9844      59478 Jones Mountains\nMartinezfort, NE 64985  74 oV       AM
9993  7555 Larson Locks Suite 229\nEllisburgh, MA 34...  72 jg       PM

                                           Browser Info  \
4     Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...
168   Mozilla/5.0 (Macintosh; PPC Mac OS X 10_7_1) A...
169   Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...
236   Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...
325   Mozilla/5.0 (Windows NT 5.01; sl-SI; rv:1.9.0....
...                                                 ...
8970  Mozilla/5.0 (Windows NT 6.1; en-US; rv:1.9.0.2...
8994  Mozilla/5.0 (compatible; MSIE 8.0; Windows 95;...
9525  Mozilla/5.0 (X11; Linux i686) AppleWebKit/5312...
9844  Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_6...
9993  Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_8...

                              Company       Credit Card CC Exp Date  \
4           Brown, Watson and Andrews  6011456623207998       10/25
168                      Hamilton PLC    30449252497493       10/25
169   Rodriguez, Contreras and Sparks  6011118388931150       10/25
236                    Jacobs-Goodman   346011014068647       10/25
325        Hunter, Meyers and Walters  3096241364986975       10/25
...                               ...               ...         ...
8970                   Valencia-Gomez  5343665582475153       10/25
8994                      Gilbert PLC  6011544812594563       10/25
9525        Hicks, Russell and Conley  6011160207837184       10/25
9844                  Torres and Sons     4537373426912       10/25
9993                   Colon and Sons    30025560104631       10/25

      CC Security Code                  CC Provider  \
4                  678  Diners Club / Carte Blanche
168                621                VISA 13 digit
169                177                     Discover
236                984                VISA 16 digit
325               7773                      Voyager
...                ...                          ...
8970               261                VISA 16 digit
8994               866  Diners Club / Carte Blanche
9525               994                VISA 16 digit
9844               246                      Maestro
9993               629                      Maestro

                            Email                            Job  \
4     christopherwright@gmail.com                    Fine artist
168           michael56@yahoo.com         Programmer, multimedia
169         stoneherbert@hood.com          Scientist, biomedical
236   melindahays@smith-bates.com       Public relations officer
325               whill@green.com            Mental health nurse
...                           ...                            ...
8970           jessica77@bass.net                     Translator
8994          jasmine65@gmail.com  Interior and spatial designer
9525         xfernandez@yahoo.com           Intelligence analyst
9844             rita73@gmail.com                     Printmaker
9993    chelseawilliams@lopez.biz   Designer, exhibition/display

           IP Address Language  Purchase Price
4        24.140.33.94       es           77.82
168   244.159.126.125       zh           22.55
169     40.247.85.129       zh           62.09
236   144.213.169.199       it           53.61
325       246.2.45.40       el           38.45
...               ...      ...             ...
8970  207.215.141.148       es           49.73
8994    101.251.22.91       zh           85.99
9525  142.169.151.131       el           90.14
9844   108.181.246.46       zh           47.17
9993    177.46.82.128       el           65.61

[64 rows x 14 columns]
                                                Address    Lot AM or PM  \
86    9185 Joshua Throughway\nSanchezton, NH 83867-1998  18 as       PM
183   0024 Smith Tunnel Suite 760\nPort Leeton, CO 8...  52 Eg       PM
185                403 Frank Ridges\nRyanview, CT 46154  76 FD       AM
218                 1973 Ryan Rue\nWendymouth, AK 14648  30 vb       PM
219                           USNS Levine\nFPO AP 68420  64 Bx       AM
...                                                 ...    ...      ...
9263  51740 Nathan Trail Apt. 857\nNew Christopherbe...  20 HF       AM
9283    5170 Johnson Plaza\nBrucechester, NV 95750-1972  76 pP       PM
9350             498 Gomez Crescent\nNew John, AZ 15469  61 qO       AM
9492  03649 Ross Skyway Suite 448\nPort Teresahaven,...  33 It       PM
9913           13914 Casey Unions\nWillisside, WA 40015  47 zP       PM

                                           Browser Info  \
86    Opera/8.32.(Windows NT 5.1; sl-SI) Presto/2.9....
183   Mozilla/5.0 (compatible; MSIE 7.0; Windows NT ...
185   Opera/8.83.(Windows NT 5.1; it-IT) Presto/2.9....
218   Mozilla/5.0 (iPod; U; CPU iPhone OS 4_1 like M...
219   Opera/9.64.(X11; Linux x86_64; en-US) Presto/2...
...                                                 ...
9263  Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10_8_2...
9283  Mozilla/5.0 (X11; Linux x86_64; rv:1.9.6.20) G...
9350  Opera/9.40.(X11; Linux x86_64; it-IT) Presto/2...
9492  Mozilla/5.0 (Windows NT 5.2) AppleWebKit/5360 ...
9913  Mozilla/5.0 (Macintosh; PPC Mac OS X 10_5_7 rv...

                       Company       Credit Card CC Exp Date  \
86              Figueroa-Jones     4505820111106       11/25
183   Lane, Graves and Coleman  3088842158087639       11/25
185             Irwin-Morrison  5593709933050708       11/25
218                   Ross-Kim  3337085291473253       11/25
219   Bates, Wright and Conrad   210059411642194       11/25
...                        ...               ...         ...
9263                Carr-Woods   377366581638517       11/25
9283   Green, Brown and Hudson  4291091814009550       11/25
9350                  Khan LLC   343001485932770       11/25
9492             Gallagher Ltd  3088277375216176       11/25
9913    Berry, Rocha and Ayers   180049776099458       11/25

      CC Security Code       CC Provider                      Email  \
86                 446     VISA 16 digit  thomas17@smith-brown.info
183                529     VISA 16 digit       perrydavid@gmail.com
185                996  American Express     shafferadam@wright.com
218                807      JCB 16 digit          halljack@bass.com
219                517     VISA 16 digit      william99@hotmail.com
...                ...               ...                        ...
9263              8591     VISA 16 digit         kevinknox@rich.com
9283              6186     VISA 16 digit    martindavis@hotmail.com
9350               556           Voyager          xjones@valdez.com
9492               790     VISA 16 digit          craig05@gmail.com
9913               195     VISA 13 digit      taylorjohn@daniel.com

                                Job       IP Address Language  Purchase Price
86                    Administrator   200.222.13.136       de           90.00
183                   Retail banker    69.198.36.193       fr            0.33
185                   Art therapist     29.118.8.218       pt           69.05
218                      Podiatrist    199.49.184.54       el           73.13
219                      Air broker   10.219.129.121       es           33.58
...                             ...              ...      ...             ...
9263  Development worker, community     40.140.221.6       de           79.09
9283       Educational psychologist   170.186.182.14       de            2.33
9350                    Fine artist  203.233.187.117       fr           17.21
9492         Psychotherapist, child   75.221.109.214       pt           11.52
9913          Accountant, chartered   163.34.234.113       de           34.85

[67 rows x 14 columns]
                                                Address    Lot AM or PM  \
178   9663 Eric Trail Apt. 905\nChadville, WA 01391-...  21 PC       AM
226     225 Franco Ranch\nEast Jamesfurt, MT 98684-5498  58 cz       AM
353            52488 Lopez Ports\nSouth Logan, WY 40351  24 xc       PM
410             29635 Toni Court\nMartinville, KS 34487  64 uc       PM
460   65994 Allen Groves Suite 038\nEast Christineha...  45 lF       AM
...                                                 ...    ...      ...
9233  470 David Road Apt. 398\nMelissaborough, ME 64...  25 cN       AM
9302  697 Cantu Mountains Apt. 658\nLake Steven, UT ...  96 uI       PM
9314  145 Jennifer Orchard Apt. 762\nBridgetmouth, D...  19 oM       AM
9317    053 Park Parkways\nSouth Alexton, UT 68787-3888  61 SV       AM
9780      2203 Carlos Plains\nBeckerstad, CO 44247-1590  03 LY       PM

                                           Browser Info  \
178   Opera/8.85.(X11; Linux i686; it-IT) Presto/2.9...
226   Opera/8.59.(X11; Linux i686; en-US) Presto/2.9...
353   Mozilla/5.0 (Windows; U; Windows NT 5.01) Appl...
410   Mozilla/5.0 (Windows NT 5.01; it-IT; rv:1.9.1....
460   Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...
...                                                 ...
9233  Mozilla/5.0 (iPod; U; CPU iPhone OS 4_3 like M...
9302  Mozilla/5.0 (Windows NT 5.2) AppleWebKit/5320 ...
9314  Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10_6_7...
9317  Mozilla/5.0 (compatible; MSIE 9.0; Windows 98;...
9780  Opera/9.51.(X11; Linux x86_64; sl-SI) Presto/2...

                        Company       Credit Card CC Exp Date  \
178                  Vargas Ltd   210011075624182       12/25
226                Garcia-Brown  4420415261496511       12/25
353   Pham, Mitchell and Walker   210075482781760       12/25
410    Wagner, Owens and Bishop    30114207203152       12/25
460               Alvarez-Gomez  3112643799288705       12/25
...                         ...               ...         ...
9233             Phillips Group  4367083157104980       12/25
9302                Leach-Baker  4812490020228279       12/25
9314               Barnes Group  5238741608291359       12/25
9317   Hunt, King and Mcfarland  6011294657063718       12/25
9780           Thompson-Spencer    30566585123338       12/25

      CC Security Code                  CC Provider  \
178                 28                VISA 13 digit
226                788                      Maestro
353                 84  Diners Club / Carte Blanche
410                833                 JCB 15 digit
460                443                VISA 16 digit
...                ...                          ...
9233               333                   Mastercard
9302                41                 JCB 16 digit
9314               637                   Mastercard
9317               520                 JCB 15 digit
9780               729                 JCB 16 digit

                               Email                      Job      IP Address  \
178            andrewskatie@good.com             Photographer   244.173.16.15
226         hughesshelly@elliott.com       Surveyor, building   58.173.18.114
353            annette04@sanford.com        Food technologist  218.255.230.33
410                wendy24@moore.org     Biomedical scientist   15.184.100.29
460                   kyle04@cox.com    Management consultant   54.143.195.76
...                              ...                      ...             ...
9233              hannah90@yahoo.com  Therapist, occupational    171.148.76.3
9302              amanda52@yahoo.com              Hydrologist  83.143.219.226
9314               shane71@yahoo.com  Presenter, broadcasting  102.13.179.244
9317  anthonybailey@shaw-griffin.net    Volunteer coordinator   18.238.192.32
9780          michaelprice@gmail.com         Network engineer  251.142.31.170

     Language  Purchase Price
178        de           35.70
226        fr            3.00
353        it           69.52
410        ru           67.77
460        fr           33.65
...       ...             ...
9233       es           13.38
9302       de           47.53
9314       it           16.29
9317       es           58.41
9780       zh           94.94

[91 rows x 14 columns]

In [82]:
a=0
for i in range(1,13):
    a=a+len(ecom[ecom['CC Exp Date']==f'{i}/25'])
print(a)

222

In [67]:
ecom['Email'].value_counts()[:5]

brownsarah@gmail.com        2
hcarter@hotmail.com         2
cbrown@gmail.com            2
jennifertaylor@gmail.com    2
christopher29@gmail.com     2
Name: Email, dtype: int64

In [86]:
ecom['Email'].str.find('gmail.com')

0       -1
1       -1
2       -1
3       -1
4       18
        ..
9995    -1
9996    -1
9997     8
9998    -1
9999    -1
Name: Email, Length: 10000, dtype: int64